const Welcome: React.FC = () => {

  return (
    <>
      <h3>学院本科评估数据采集系统</h3>
      <br />
      <br />
      <p>学院本科评估数据采集系统采取B/S技术架构<br /><br />
        前端开发采用JavaScript作为主要开发语言，结合Ant Design Pro完成前端页面构建<br /><br />
        后端开发采用NodeJS，结合Egg.js完成后端数据处理，数据库采用MySQL<br /><br /><br />
        依照软件工程开发流程，对评估数据采集系统进行需求分析，<br /><br />
        针对不同的角色用户进行功能划分，主要分为用户管理模块、评估数据管理模块以及辅助功能模块。<br /><br />
        其中，评估数据管理模块又包括科研项目管理、论文管理、专利管理、奖项管理、会议管理几个数据管理模块。<br /><br />
        针对不同的模块进行具体设计，包括前端界面、后端数据处理、数据库设计等。根据设计进行系统实现，将代码落地，将系统实现。<br />
      </p>
    </>
  );
};

export default Welcome;
